package day0302;
//자바의 명명규칙(Naming convention)
/*1.공통규칙 
      A.이름에는 _를 제외한 특수문자는 사용할수 없다.
      B.이름의 중간이나 맨 마지막에는 숫자가 올수도 있다.숫자로 이름을 시작할수는 없다.
      C.이제 한글로 이름을 지어줄수 있긴 하지만 절대로 절대로 그러지 말자.
      D.자바에서는 내부적으로 실행할 명령어가 정의된 50여가지의 키워드가 존재.
                 해당 키워드들로는 이름을 지어줄 수 없기 때문에 내일16시에 50여가지 적는 시험을 보겠다.
                 이름을 지어 줬는데 자주색으로 표시될경우 , 이름에 변형, 동의어 사용.
   2.낙타등 표기법과 뱀 표기법
       A.낙타등 표기법(Camel Back Notation)
                     낙타등 표기법이란 이름이 여러단어로 이루어져있을 경우 두번째 단어부터는 첫글자를 대문자로 적는 방법.
       B.뱀 표기법(Snake Notation)
                     뱀 표기법이란 모든 글자를 대문자로 적어 주는 경우 단어의 사이마다 _를 넣어 단어별 구분을 쉽게 해주는 방법.

   3.여러가지 분류에 대한 이름 짓는 방법
       A.클래스(Class)
                        대문자로 시작하고 낙타등 표기법을 사용하는 명사
       B.패키지(Package)
                       소문자로 시작하고 낙타등 표기법을 사용하지만 모여있는 클래스들의 성격을 주로 한단어로만 표시하는 명사
       C.메소드(Method)
                     소문자로 시작하고 낙타등 표기법을 사용하는 동사
                     단, 프로그래밍 규칙상 메소드는 반드시 이름 뒤에 ()가 붙는다.
       D.변수(Variable)
                     소문자로 시작하고 낙타등 표기법을 사용하는 명사.
       E.상수(Constant)
                      뱀표기법을 사용하는 명사
       
*/
public class Ex02NamingConvention {
    /*
         아래의 이름이 각각 무엇의 종류인지 맞춰보시오
         1.MemeberController :클래스
         2.memberController: 변수
         3.selectAll() : 메소드
         4.FILE_PATH : 상수
     */

}
